RIOT-OS/RIOT/cpu/StellarisWare/inc/lm4fs1gh5bb.h
//*****************************************************************************
//
// GPIO registers (PORTQ)
//
//*****************************************************************************
#define GPIO_PORTQ_DATA_BITS_R  ((volatile unsigned long *)0x40066000)
#define GPIO_PORTQ_DATA_R       (*((volatile unsigned long *)0x400663FC))
#define GPIO_PORTQ_DIR_R        (*((volatile unsigned long *)0x40066400))
#define GPIO_PORTQ_IS_R         (*((volatile unsigned long *)0x40066404))
#define GPIO_PORTQ_IBE_R        (*((volatile unsigned long *)0x40066408))
#define GPIO_PORTQ_IEV_R        (*((volatile unsigned long *)0x4006640C))
#define GPIO_PORTQ_IM_R         (*((volatile unsigned long *)0x40066410))
#define GPIO_PORTQ_RIS_R        (*((volatile unsigned long *)0x40066414))
#define GPIO_PORTQ_MIS_R        (*((volatile unsigned long *)0x40066418))
#define GPIO_PORTQ_ICR_R        (*((volatile unsigned long *)0x4006641C))
#define GPIO_PORTQ_AFSEL_R      (*((volatile unsigned long *)0x40066420))
#define GPIO_PORTQ_DR2R_R       (*((volatile unsigned long *)0x40066500))
#define GPIO_PORTQ_DR4R_R       (*((volatile unsigned long *)0x40066504))
#define GPIO_PORTQ_DR8R_R       (*((volatile unsigned long *)0x40066508))
#define GPIO_PORTQ_ODR_R        (*((volatile unsigned long *)0x4006650C))
#define GPIO_PORTQ_PUR_R        (*((volatile unsigned long *)0x40066510))
#define GPIO_PORTQ_PDR_R        (*((volatile unsigned long *)0x40066514))
#define GPIO_PORTQ_SLR_R        (*((volatile unsigned long *)0x40066518))
#define GPIO_PORTQ_DEN_R        (*((volatile unsigned long *)0x4006651C))
#define GPIO_PORTQ_LOCK_R       (*((volatile unsigned long *)0x40066520))
#define GPIO_PORTQ_CR_R         (*((volatile unsigned long *)0x40066524))
#define GPIO_PORTQ_AMSEL_R      (*((volatile unsigned long *)0x40066528))
#define GPIO_PORTQ_PCTL_R       (*((volatile unsigned long *)0x4006652C))
#define GPIO_PORTQ_ADCCTL_R     (*((volatile unsigned long *)0x40066530))
#define GPIO_PORTQ_DMACTL_R     (*((volatile unsigned long *)0x40066534))
#define GPIO_PORTQ_SI_R         (*((volatile unsigned long *)0x40066538))

//*****************************************************************************
//
// LPC registers (LPC0)
//
//*****************************************************************************
#define LPC0_CTL_R              (*((volatile unsigned long *)0x40080000))
#define LPC0_STS_R              (*((volatile unsigned long *)0x40080004))
#define LPC0_IRQCTL_R           (*((volatile unsigned long *)0x40080008))
#define LPC0_IRQST_R            (*((volatile unsigned long *)0x4008000C))
#define LPC0_CH0CTL_R           (*((volatile unsigned long *)0x40080010))
#define LPC0_CH0ST_R            (*((volatile unsigned long *)0x40080014))
#define LPC0_CH0ADR_R           (*((volatile unsigned long *)0x40080018))
#define LPC0_CH1CTL_R           (*((volatile unsigned long *)0x40080020))
#define LPC0_CH1ST_R            (*((volatile unsigned long *)0x40080024))
#define LPC0_CH1ADR_R           (*((volatile unsigned long *)0x40080028))
#define LPC0_CH2CTL_R           (*((volatile unsigned long *)0x40080030))
#define LPC0_CH2ST_R            (*((volatile unsigned long *)0x40080034))
#define LPC0_CH2ADR_R           (*((volatile unsigned long *)0x40080038))
#define LPC0_CH3CTL_R           (*((volatile unsigned long *)0x40080040))
#define LPC0_CH3ST_R            (*((volatile unsigned long *)0x40080044))
#define LPC0_CH3ADR_R           (*((volatile unsigned long *)0x40080048))
#define LPC0_CH4CTL_R           (*((volatile unsigned long *)0x40080050))
#define LPC0_CH4ST_R            (*((volatile unsigned long *)0x40080054))
#define LPC0_CH4ADR_R           (*((volatile unsigned long *)0x40080058))
#define LPC0_CH5CTL_R           (*((volatile unsigned long *)0x40080060))
#define LPC0_CH5ST_R            (*((volatile unsigned long *)0x40080064))
#define LPC0_CH5ADR_R           (*((volatile unsigned long *)0x40080068))
#define LPC0_CH6CTL_R           (*((volatile unsigned long *)0x40080070))
#define LPC0_CH6ST_R            (*((volatile unsigned long *)0x40080074))
#define LPC0_CH6ADR_R           (*((volatile unsigned long *)0x40080078))
#define LPC0_CH7CTL_R           (*((volatile unsigned long *)0x40080080))
#define LPC0_CH7ST_R            (*((volatile unsigned long *)0x40080084))
#define LPC0_CH7ADR_R           (*((volatile unsigned long *)0x40080088))
#define LPC0_STSADDR_R          (*((volatile unsigned long *)0x400800A0))
#define LPC0_IM_R               (*((volatile unsigned long *)0x40080100))
#define LPC0_RIS_R              (*((volatile unsigned long *)0x40080104))
#define LPC0_MIS_R              (*((volatile unsigned long *)0x40080108))
#define LPC0_IC_R               (*((volatile unsigned long *)0x4008010C))
#define LPC0_DMACX_R            (*((volatile unsigned long *)0x40080120))
#define LPC0_POOL_R             (*((volatile unsigned long *)0x40080400))
#define LPC0_PP_R               (*((volatile unsigned long *)0x40080FC0))

//*****************************************************************************
//
// Fan Control registers (FAN0)
//
//*****************************************************************************
#define FAN0_STS_R              (*((volatile unsigned long *)0x40084000))
#define FAN0_CTL_R              (*((volatile unsigned long *)0x40084004))
#define FAN0_CH0_R              (*((volatile unsigned long *)0x40084010))
#define FAN0_CMD0_R             (*((volatile unsigned long *)0x40084014))
#define FAN0_CST0_R             (*((volatile unsigned long *)0x40084018))
#define FAN0_CH1_R              (*((volatile unsigned long *)0x40084020))
#define FAN0_CMD1_R             (*((volatile unsigned long *)0x40084024))
#define FAN0_CST1_R             (*((volatile unsigned long *)0x40084028))
#define FAN0_CH2_R              (*((volatile unsigned long *)0x40084030))
#define FAN0_CMD2_R             (*((volatile unsigned long *)0x40084034))
#define FAN0_CST2_R             (*((volatile unsigned long *)0x40084038))
#define FAN0_CH3_R              (*((volatile unsigned long *)0x40084040))
#define FAN0_CMD3_R             (*((volatile unsigned long *)0x40084044))
#define FAN0_CST3_R             (*((volatile unsigned long *)0x40084048))
#define FAN0_CH4_R              (*((volatile unsigned long *)0x40084050))
#define FAN0_CMD4_R             (*((volatile unsigned long *)0x40084054))
#define FAN0_CST4_R             (*((volatile unsigned long *)0x40084058))
#define FAN0_CH5_R              (*((volatile unsigned long *)0x40084060))
#define FAN0_CMD5_R             (*((volatile unsigned long *)0x40084064))
#define FAN0_CST5_R             (*((volatile unsigned long *)0x40084068))
#define FAN0_IM_R               (*((volatile unsigned long *)0x40084090))
#define FAN0_RIS_R              (*((volatile unsigned long *)0x40084094))
#define FAN0_MIS_R              (*((volatile unsigned long *)0x40084098))
#define FAN0_IC_R               (*((volatile unsigned long *)0x4008409C))
#define FAN0_PP_R               (*((volatile unsigned long *)0x40084FC0))

//*****************************************************************************
//
// EEPROM registers (EEPROM)
//
//*****************************************************************************
#define EEPROM_EESIZE_R         (*((volatile unsigned long *)0x400AF000))
#define EEPROM_EEBLOCK_R        (*((volatile unsigned long *)0x400AF004))
#define EEPROM_EEOFFSET_R       (*((volatile unsigned long *)0x400AF008))
#define EEPROM_EERDWR_R         (*((volatile unsigned long *)0x400AF010))
#define EEPROM_EERDWRINC_R      (*((volatile unsigned long *)0x400AF014))
#define EEPROM_EEDONE_R         (*((volatile unsigned long *)0x400AF018))
#define EEPROM_EESUPP_R         (*((volatile unsigned long *)0x400AF01C))
#define EEPROM_EEUNLOCK_R       (*((volatile unsigned long *)0x400AF020))
#define EEPROM_EEPROT_R         (*((volatile unsigned long *)0x400AF030))
#define EEPROM_EEPASS0_R        (*((volatile unsigned long *)0x400AF034))
#define EEPROM_EEPASS1_R        (*((volatile unsigned long *)0x400AF038))
#define EEPROM_EEPASS2_R        (*((volatile unsigned long *)0x400AF03C))
#define EEPROM_EEINT_R          (*((volatile unsigned long *)0x400AF040))
#define EEPROM_EEHIDE_R         (*((volatile unsigned long *)0x400AF050))
#define EEPROM_EEDBGME_R        (*((volatile unsigned long *)0x400AF080))
#define EEPROM_PP_R             (*((volatile unsigned long *)0x400AFFC0))

//*****************************************************************************
//
// PECI registers (PECI0)
//
//*****************************************************************************
#define PECI0_CTL_R             (*((volatile unsigned long *)0x400B0000))
#define PECI0_DIV_R             (*((volatile unsigned long *)0x400B0004))
#define PECI0_M0D0C_R           (*((volatile unsigned long *)0x400B0010))
#define PECI0_M0D1C_R           (*((volatile unsigned long *)0x400B0014))
#define PECI0_M1D0C_R           (*((volatile unsigned long *)0x400B0018))
#define PECI0_M1D1C_R           (*((volatile unsigned long *)0x400B001C))
#define PECI0_M0D0_R            (*((volatile unsigned long *)0x400B0040))
#define PECI0_M0D1_R            (*((volatile unsigned long *)0x400B0044))
#define PECI0_M1D0_R            (*((volatile unsigned long *)0x400B0048))
#define PECI0_M1D1_R            (*((volatile unsigned long *)0x400B004C))
#define PECI0_IM_R              (*((volatile unsigned long *)0x400B0080))
#define PECI0_RIS_R             (*((volatile unsigned long *)0x400B0084))
#define PECI0_MIS_R             (*((volatile unsigned long *)0x400B0088))
#define PECI0_IC_R              (*((volatile unsigned long *)0x400B008C))
#define PECI0_ACADDR_R          (*((volatile unsigned long *)0x400B0100))
#define PECI0_ACARG_R           (*((volatile unsigned long *)0x400B0104))
#define PECI0_ACRDWR0_R         (*((volatile unsigned long *)0x400B0108))
#define PECI0_ACRDWR1_R         (*((volatile unsigned long *)0x400B010C))
#define PECI0_ACCMD_R           (*((volatile unsigned long *)0x400B0110))
#define PECI0_ACCODE_R          (*((volatile unsigned long *)0x400B0114))

//*****************************************************************************
//
// I2C registers (I2C4 MASTER)
//
//*****************************************************************************
#define I2C4_MASTER_MSA_R       (*((volatile unsigned long *)0x400C0000))
#define I2C4_MASTER_MCS_R       (*((volatile unsigned long *)0x400C0004))
#define I2C4_MASTER_MDR_R       (*((volatile unsigned long *)0x400C0008))
#define I2C4_MASTER_MTPR_R      (*((volatile unsigned long *)0x400C000C))
#define I2C4_MASTER_MIMR_R      (*((volatile unsigned long *)0x400C0010))
#define I2C4_MASTER_MRIS_R      (*((volatile unsigned long *)0x400C0014))
#define I2C4_MASTER_MMIS_R      (*((volatile unsigned long *)0x400C0018))
#define I2C4_MASTER_MICR_R      (*((volatile unsigned long *)0x400C001C))
#define I2C4_MASTER_MCR_R       (*((volatile unsigned long *)0x400C0020))
#define I2C4_MASTER_MCLKOCNT_R  (*((volatile unsigned long *)0x400C0024))
#define I2C4_MASTER_MBMON_R     (*((volatile unsigned long *)0x400C002C))

//*****************************************************************************
//
// I2C registers (I2C4 SLAVE)
//
//*****************************************************************************
#define I2C4_SLAVE_SOAR_R       (*((volatile unsigned long *)0x400C0800))
#define I2C4_SLAVE_SCSR_R       (*((volatile unsigned long *)0x400C0804))
#define I2C4_SLAVE_SDR_R        (*((volatile unsigned long *)0x400C0808))
#define I2C4_SLAVE_SIMR_R       (*((volatile unsigned long *)0x400C080C))
#define I2C4_SLAVE_SRIS_R       (*((volatile unsigned long *)0x400C0810))
#define I2C4_SLAVE_SMIS_R       (*((volatile unsigned long *)0x400C0814))
#define I2C4_SLAVE_SICR_R       (*((volatile unsigned long *)0x400C0818))
#define I2C4_SLAVE_SOAR2_R      (*((volatile unsigned long *)0x400C081C))
#define I2C4_SLAVE_SACKCTL_R    (*((volatile unsigned long *)0x400C0820))

//*****************************************************************************
//
// I2C registers (I2C5 MASTER)
//
//*****************************************************************************
#define I2C5_MASTER_MSA_R       (*((volatile unsigned long *)0x400C1000))
#define I2C5_MASTER_MCS_R       (*((volatile unsigned long *)0x400C1004))
#define I2C5_MASTER_MDR_R       (*((volatile unsigned long *)0x400C1008))
#define I2C5_MASTER_MTPR_R      (*((volatile unsigned long *)0x400C100C))
#define I2C5_MASTER_MIMR_R      (*((volatile unsigned long *)0x400C1010))
#define I2C5_MASTER_MRIS_R      (*((volatile unsigned long *)0x400C1014))
#define I2C5_MASTER_MMIS_R      (*((volatile unsigned long *)0x400C1018))
#define I2C5_MASTER_MICR_R      (*((volatile unsigned long *)0x400C101C))
#define I2C5_MASTER_MCR_R       (*((volatile unsigned long *)0x400C1020))
#define I2C5_MASTER_MCLKOCNT_R  (*((volatile unsigned long *)0x400C1024))
#define I2C5_MASTER_MBMON_R     (*((volatile unsigned long *)0x400C102C))

//*****************************************************************************
//
// I2C registers (I2C5 SLAVE)
//
//*****************************************************************************
#define I2C5_SLAVE_SOAR_R       (*((volatile unsigned long *)0x400C1800))
#define I2C5_SLAVE_SCSR_R       (*((volatile unsigned long *)0x400C1804))
#define I2C5_SLAVE_SDR_R        (*((volatile unsigned long *)0x400C1808))
#define I2C5_SLAVE_SIMR_R       (*((volatile unsigned long *)0x400C180C))
#define I2C5_SLAVE_SRIS_R       (*((volatile unsigned long *)0x400C1810))
#define I2C5_SLAVE_SMIS_R       (*((volatile unsigned long *)0x400C1814))
#define I2C5_SLAVE_SICR_R       (*((volatile unsigned long *)0x400C1818))
#define I2C5_SLAVE_SOAR2_R      (*((volatile unsigned long *)0x400C181C))
#define I2C5_SLAVE_SACKCTL_R    (*((volatile unsigned long *)0x400C1820))

//*****************************************************************************
//
// System Exception Module registers (SYSEXC)
//
//*****************************************************************************
#define SYSEXC_RIS_R            (*((volatile unsigned long *)0x400F9000))
#define SYSEXC_IM_R             (*((volatile unsigned long *)0x400F9004))
#define SYSEXC_MIS_R            (*((volatile unsigned long *)0x400F9008))
#define SYSEXC_IC_R             (*((volatile unsigned long *)0x400F900C))

//*****************************************************************************
//
// Hibernation module registers (HIB)
//
//*****************************************************************************
#define HIB_RTCC_R              (*((volatile unsigned long *)0x400FC000))
#define HIB_RTCM0_R             (*((volatile unsigned long *)0x400FC004))
#define HIB_RTCLD_R             (*((volatile unsigned long *)0x400FC00C))
#define HIB_CTL_R               (*((volatile unsigned long *)0x400FC010))
#define HIB_IM_R                (*((volatile unsigned long *)0x400FC014))
#define HIB_RIS_R               (*((volatile unsigned long *)0x400FC018))
#define HIB_MIS_R               (*((volatile unsigned long *)0x400FC01C))
#define HIB_IC_R                (*((volatile unsigned long *)0x400FC020))
#define HIB_RTCT_R              (*((volatile unsigned long *)0x400FC024))
#define HIB_RTCSS_R             (*((volatile unsigned long *)0x400FC028))
#define HIB_DATA_R              (*((volatile unsigned long *)0x400FC030))

//*****************************************************************************
//
// FLASH registers (FLASH CTRL)
//
//*****************************************************************************
#define FLASH_FMA_R             (*((volatile unsigned long *)0x400FD000))
#define FLASH_FMD_R             (*((volatile unsigned long *)0x400FD004))
#define FLASH_FMC_R             (*((volatile unsigned long *)0x400FD008))
#define FLASH_FCRIS_R           (*((volatile unsigned long *)0x400FD00C))
#define FLASH_FCIM_R            (*((volatile unsigned long *)0x400FD010))
#define FLASH_FCMISC_R          (*((volatile unsigned long *)0x400FD014))
#define FLASH_FMC2_R            (*((volatile unsigned long *)0x400FD020))
#define FLASH_FWBVAL_R          (*((volatile unsigned long *)0x400FD030))
#define FLASH_FWBN_R            (*((volatile unsigned long *)0x400FD100))
#define FLASH_FSIZE_R           (*((volatile unsigned long *)0x400FDFC0))
#define FLASH_SSIZE_R           (*((volatile unsigned long *)0x400FDFC4))
#define FLASH_ROMSWMAP_R        (*((volatile unsigned long *)0x400FDFCC))
#define FLASH_RMCTL_R           (*((volatile unsigned long *)0x400FE0F0))
#define FLASH_BOOTCFG_R         (*((volatile unsigned long *)0x400FE1D0))
#define FLASH_USERREG0_R        (*((volatile unsigned long *)0x400FE1E0))
#define FLASH_USERREG1_R        (*((volatile unsigned long *)0x400FE1E4))
#define FLASH_USERREG2_R        (*((volatile unsigned long *)0x400FE1E8))
#define FLASH_USERREG3_R        (*((volatile unsigned long *)0x400FE1EC))
#define FLASH_FMPRE0_R          (*((volatile unsigned long *)0x400FE200))
#define FLASH_FMPRE1_R          (*((volatile unsigned long *)0x400FE204))
#define FLASH_FMPRE2_R          (*((volatile unsigned long *)0x400FE208))
#define FLASH_FMPRE3_R          (*((volatile unsigned long *)0x400FE20C))
#define FLASH_FMPPE0_R          (*((volatile unsigned long *)0x400FE400))
#define FLASH_FMPPE1_R          (*((volatile unsigned long *)0x400FE404))
#define FLASH_FMPPE2_R          (*((volatile unsigned long *)0x400FE408))
#define FLASH_FMPPE3_R          (*((volatile unsigned long *)0x400FE40C))

